# Point Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundingBoxContainsPointFilter..::..Point Property
BoundingBoxContainsPointFilter Class See Also
---
The XYZ point to use when matching element bounding boxes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public XYZ Point { get; set; }
```

Visual Basic
---
```text
Public Property Point As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
BoundingBoxContainsPointFilter Class
Autodesk.Revit.DB Namespace